In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('data.csv', encoding='unicode_escape')

In [3]:
df1 = df.copy() #backup

In [4]:
df.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [5]:
df.shape

(541909, 8)

In [6]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

In [7]:
df.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

In [2]:
#invoice no has columns one containing cancelled orders& regulars so creating an ordertype column,
#invoicedate should be datetime format and also split up in separate Date column
#date and time columns customerid should be int not float

In [1]:
#checking non numeric stockcodes

In [9]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [10]:
b = df[df['StockCode'].str.match(r'^[A-Za-z]+$')]
b.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
45,536370,POST,POSTAGE,3,12/1/2010 8:45,18.00,12583.0,France
141,C536379,D,Discount,-1,12/1/2010 9:41,27.50,14527.0,United Kingdom
386,536403,POST,POSTAGE,1,12/1/2010 11:27,15.00,12791.0,Netherlands
1123,536527,POST,POSTAGE,1,12/1/2010 13:04,18.00,12662.0,Germany
1814,536544,DOT,DOTCOM POSTAGE,1,12/1/2010 14:32,569.77,NaN,United Kingdom

In [11]:
c = df[df['StockCode'].str.match(r'^[A-Za-z]+$')]['StockCode'].unique()
c

array(['POST', 'D', 'DOT', 'M', 'S', 'AMAZONFEE', 'm', 'DCGSSBOY',
       'DCGSSGIRL', 'PADS', 'B', 'CRUK'], dtype=object)

In [12]:
len(b)

2759

In [13]:
df[df['StockCode'].isin(c)].groupby('StockCode').first().reset_index()

,StockCode,InvoiceNo,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,AMAZONFEE,C537600,AMAZON FEE,-1,12/7/2010 12:41,1.000,NaN,United Kingdom
1,B,A563185,Adjust bad debt,1,8/12/2011 14:50,11062.060,NaN,United Kingdom
2,CRUK,C564763,CRUK Commission,-1,8/30/2011 10:49,1.600,14096.0,United Kingdom
3,D,C536379,Discount,-1,12/1/2010 9:41,27.500,14527.0,United Kingdom
4,DCGSSBOY,543358,BOYS PARTY BAG,1,2/7/2011 14:04,3.290,NaN,United Kingdom
5,DCGSSGIRL,543358,GIRLS PARTY BAG,3,2/7/2011 14:04,3.290,NaN,United Kingdom
6,DOT,536544,DOTCOM POSTAGE,1,12/1/2010 14:32,569.770,14096.0,United Kingdom
7,M,536569,Manual,1,12/1/2010 15:35,1.250,16274.0,United Kingdom
8,PADS,550193,PADS TO MATCH ALL CUSHIONS,1,4/15/2011 9:27,0.001,13952.0,United Kingdom
9,POST,536370,POSTAGE,3,12/1/2010 8:45,18.000,12583.0,France
10,S,C537581,SAMPLES,-1,12/7/2010 12:03,12.950,NaN,United Kingdom
11,m,539736,Manual,1,12/21/2010 15:18,2.550,NaN,United Kingdom

In [14]:
percentage= (len(c)/len(df))*100
percentage

0.0022143939296081073

In [15]:
remove_stockcodes = ["AMAZONFEE", "B", "CRUK", "D", "DOT", "POST", "M", "m", "S"]

df = df[~df["StockCode"].isin(remove_stockcodes)]

df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [16]:
df.shape

(539178, 8)

In [17]:
b.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
45,536370,POST,POSTAGE,3,12/1/2010 8:45,18.00,12583.0,France
141,C536379,D,Discount,-1,12/1/2010 9:41,27.50,14527.0,United Kingdom
386,536403,POST,POSTAGE,1,12/1/2010 11:27,15.00,12791.0,Netherlands
1123,536527,POST,POSTAGE,1,12/1/2010 13:04,18.00,12662.0,Germany
1814,536544,DOT,DOTCOM POSTAGE,1,12/1/2010 14:32,569.77,NaN,United Kingdom

In [18]:
df['OrderType'] = df['InvoiceNo'].apply(lambda x: 'Cancelled' if str(x).startswith('C') else 'Regular')

In [19]:
df.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,Regular
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,Regular
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,Regular
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,Regular
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,Regular

In [20]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,Regular
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,Regular
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,Regular
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,Regular
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,Regular

In [21]:
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'])

In [22]:
df['Date'] = df['InvoiceDate'].dt.date

In [23]:
df['Date'] = pd.to_datetime(df['Date'])

In [24]:
df['Time'] = df['InvoiceDate'].dt.time

In [25]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,Regular,2010-12-01,08:26:00
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,Regular,2010-12-01,08:26:00
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,Regular,2010-12-01,08:26:00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,Regular,2010-12-01,08:26:00
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,Regular,2010-12-01,08:26:00

In [26]:
df.shape

(539178, 11)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 539178 entries, 0 to 541908
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    539178 non-null  object
 1   StockCode    539178 non-null  object
 2   Description  537729 non-null  object
 3   Quantity     539178 non-null  int64
 4   InvoiceDate  539178 non-null  datetime64[ns]
 5   UnitPrice    539178 non-null  float64
 6   CustomerID   405059 non-null  float64
 7   Country      539178 non-null  object
 8   OrderType    539178 non-null  object
 9   Date         539178 non-null  datetime64[ns]
 10  Time         539178 non-null  object
dtypes: datetime64[ns](2), float64(2), int64(1), object(6)
memory usage: 49.4+ MB

In [28]:
df.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1449
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     134119
Country             0
OrderType           0
Date                0
Time                0
dtype: int64

In [29]:
df.shape

(539178, 11)

In [30]:
df.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,Regular,2010-12-01,08:26:00
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,Regular,2010-12-01,08:26:00
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,Regular,2010-12-01,08:26:00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,Regular,2010-12-01,08:26:00
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,Regular,2010-12-01,08:26:00

In [31]:
df['Revenue'] = df['Quantity']*df['UnitPrice']

In [32]:
df['Quantity'].unique()

array([     6,      8,      2,     32,      3,      4,     24,     12,
           48,     18,     20,     36,     80,     64,     10,    120,
           96,     23,      5,      1,     50,     -1,     40,    100,
          192,    432,    144,    288,    -12,    -24,     16,      9,
          128,     25,     30,     28,      7,     56,     72,    200,
          600,    480,     -6,     14,     -2,     11,     33,     13,
           -4,     -5,     -7,     -3,     70,    252,     60,    216,
          384,    -10,     27,     15,     22,     19,     17,     21,
           34,     47,    108,     52,  -9360,    -38,     75,    270,
           42,    240,     90,    320,   1824,    204,     69,    -36,
         -192,   -144,    160,   2880,   1400,     39,    -48,    -50,
           26,   1440,     31,     82,     78,     97,     98,     35,
           57,    -20,    110,    -22,    -30,    -70,   -130,    -80,
         -120,    -40,    -25,    -14,    -15,    -69,   -140,   -320,
           -8,    720,    156,    324,     38,     37,     49,     95,
           -9,    -11,     29,     41,    -72,    -35,    -21,    -43,
          -19,    -18,    -44,    402,    378,    150,    300,     54,
          104,     67,    258,     66,     44,     55,     46,     99,
           61,    408,    972,    208,   1008,   1000,    -77,   1488,
          250,   1394,    400,   -223,   -150,    -13,    -33,   -723,
         -177,     79,     84,    -32,   -100,    -28,    272,   -145,
          -47,    -96,    113,     45,    106,     68,    267,    115,
           65,   1728,    -60,    -16,     53,   -240,     76,    460,
           71,     43,    213,     58,    576,   2400,    500,    180,
         -300,   -500,    -23,    752,    960,   1296,    210,    172,
          215,    129,    138,    116,    135,    197,   -106,    -54,
          -17,   -939,    147,    168,    256,   -201,    -53,    -29,
        -2600,   -990,   -290,    -45,    860,   1010,   1356,   1284,
          186,    114,    360,   1930,   2000,   3114,   1300,    670,
          111,    211,     59,   -310,    -61,    -41,    176,    648,
           62,  74215, -74215,    -64,    -84,     89,  -1400,     73,
          -57,    112,    456,    -59,    -31,   5568,   2560,    136,
          900,   -600,    -42,    -94,   -207,    -52,    130,   -206,
         2592,    420,    800,    101,   1200,    864,   -217,     94,
        -1430,   1287,   -162,   -230,   -173,   -390,   -234,    504,
          123,    118,    -76,   1056,   1500,    280,    407,    141,
          124,    -99,     51,    -92,   -741,   3906,   -400,   -114,
          102,   1152,    -88,    198,    117,     86,    125,    -86,
         -391,    -87,   -278,    140,    228,   -154,  -3000,     81,
         -675,   -210,   -345,   -975,  -1200,  -1121,    -27,   -541,
        -1277,   -197,   3000,  -1100,    -63,  -5368,    219,   -259,
          232,    -82,   -178,    170,   -110,    768,     88,    700,
         2160,   -323,   -450,   -232,    -83,   -153,   -524,  -2472,
          -49,   -105,    342,    304,    167,    -34,    640,    175,
          220,     74,     93,    164,    163,     63,    637,    122,
          158,    165,    350,    -46,    -75,   -690,    -39,    -66,
           83,   -200,    312,   -180,    392,   -624,   -194,    -26,
          -62,    -37,    -91,   -139,   -158,  -1479,    -55,   -576,
         -750,    330,    151,    -93,   -432,    -58,  -1092,   -670,
        -1300,  -1930,  -2000,  -3114,    462,    -65,    -68,    492,
         -620,    273,    -90,   -170,  -1512,    -51,     85,    -56,
         -160,   -360,    105,   -960,  -2376,   1350,    428,    336,
         -786,   -590,   -168,   -101,    -71,    132,   -413,   -664,
          227,   2700,    222,    246,   -102,    906,    756,    888,
          552,    -97,    224,    738,    608,   -212,   4300,    146,
          143,    276,   -125,   -116,   -108,   4000,   -304,   -272,
        -1206,    -95,   1600,    323,   -161,   -472,   -618,   -204,
         1515,  -1515,  -9058,  -9600,    660,   -420,   -126,   -220,
         -271,  -1440,    264,    188,    588,    612,    152,   -324,
         -480,   -164,    -78,   -118,    430,  -1681,     87,    155,
          701,    828,    540,    696,    560,   -250,   -408,   -179,
          121,   -124,    512,   -251,  -3100,   3100,   -169,    126,
          291,   3186,  -2834,   -109,    109,   -121,   -530,   -227,
          261,   -346,    352,    142,    107,   -188,  -1060,   -342,
         -288,    348,   1900,    157,   -343,   -455,    425,    968,
          684,    824,   -828,   -701,    196,    248,    410,    236,
          230,   -156,   -553,    145,    448,    245,   -252,   -334,
         -318,   -113,   -115,    171,   -242,    840,   -967,   -203,
        -3167,   -443,  -1897,    225,   -434,   -682,   -484,    682,
          344,   -635,   -117,  -3667,    450,    310,    494,   -384,
           92,   1788,   -138,    624,    744,    416,    496,    396,
          306,   1878,   1944,    666,    708,   1428,    852,   1412,
          528,   -756,   -752,   -152,    -85,   -312,    -79,   -147,
          -67,   -131,   -209,   -186,   -231,   -129,   -458,   -275,
        -2880,   1540,    672,   -800,   -430,   -380,    -74,   -720,
         -840,  -1296,   -365,   -104,   -270,    -73,   -306,     91,
          255,    468,   -468,   -111,   -184,   -103,   -335,   4800,
         -112,  -1000,    912,   1992,    184,    148,   -657,  -1671,
        -1158,  -2618,  -2003,   -674,  -4830,   -905,  -1128,    992,
          630,   1020,   2100,    162,  -1560,  -1284,    -81,    314,
          370,    131,    133,    484,    149,    153,    257,    139,
          137,    628,    179,   1820,    478,    335,    253,    242,
          375,   -276,   -256,    281,    193,    181,    404,    244,
          207,    199,   1130,    326,    654,    688,    268,    183,
          249,   -864,    234,  -1510,   -550,   -244,   -132,   -327,
         -313,    279,   -398,   -280,    374,   -504,   -696,   -149,
         -224,   -428,    212,   -267,   -175,  12540,    760,    -98,
          774,   -151,   2040,  -1131,   -135,   1120,     77,   -900,
          177,    490,    388,    620,   1404,   -155,   -355,   -337,
        -1050,   -338,    205,   -235,    698,  80995, -80995],
      dtype=int64)

In [33]:
df[df['Quantity']== -74215]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time,Revenue
61624,C541433,23166,MEDIUM CERAMIC TOP STORAGE JAR,-74215,2011-01-18 10:17:00,1.04,12346.0,United Kingdom,Cancelled,2011-01-18,10:17:00,-77183.6

In [34]:
df[df['Quantity']== 74215]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time,Revenue
61619,541431,23166,MEDIUM CERAMIC TOP STORAGE JAR,74215,2011-01-18 10:01:00,1.04,12346.0,United Kingdom,Regular,2011-01-18,10:01:00,77183.6

In [35]:
df[df['Quantity']== -80995]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time,Revenue
540422,C581484,23843,"PAPER CRAFT , LITTLE BIRDIE",-80995,2011-12-09 09:27:00,2.08,16446.0,United Kingdom,Cancelled,2011-12-09,09:27:00,-168469.6

In [36]:
df[df['Quantity']== 80995]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time,Revenue
540421,581483,23843,"PAPER CRAFT , LITTLE BIRDIE",80995,2011-12-09 09:15:00,2.08,16446.0,United Kingdom,Regular,2011-12-09,09:15:00,168469.6

In [37]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time,Revenue
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,Regular,2010-12-01,08:26:00,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,Regular,2010-12-01,08:26:00,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,Regular,2010-12-01,08:26:00,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,Regular,2010-12-01,08:26:00,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,Regular,2010-12-01,08:26:00,20.34

In [38]:
df['Revenue'].sum()

9793205.054

In [39]:
df.shape

(539178, 12)

In [ ]:
# Will not include these huge quantitites as they were later cancelled!

### HANDLING DUPLICATES

In [40]:
duplicates = df[df.duplicated(keep=False)]

In [41]:
print(duplicates.shape)

(10139, 12)

In [42]:
duplicates.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time,Revenue
485,536409,22111,SCOTTIE DOG HOT WATER BOTTLE,1,2010-12-01 11:45:00,4.95,17908.0,United Kingdom,Regular,2010-12-01,11:45:00,4.95
489,536409,22866,HAND WARMER SCOTTY DOG DESIGN,1,2010-12-01 11:45:00,2.10,17908.0,United Kingdom,Regular,2010-12-01,11:45:00,2.10
494,536409,21866,UNION JACK FLAG LUGGAGE TAG,1,2010-12-01 11:45:00,1.25,17908.0,United Kingdom,Regular,2010-12-01,11:45:00,1.25
517,536409,21866,UNION JACK FLAG LUGGAGE TAG,1,2010-12-01 11:45:00,1.25,17908.0,United Kingdom,Regular,2010-12-01,11:45:00,1.25
521,536409,22900,SET 2 TEA TOWELS I LOVE LONDON,1,2010-12-01 11:45:00,2.95,17908.0,United Kingdom,Regular,2010-12-01,11:45:00,2.95

In [43]:
duplicates_sorted = duplicates.sort_values(by=['InvoiceNo','StockCode', 'Description', 'Quantity','InvoiceDate', 'UnitPrice','CustomerID', 'Country', 'OrderType','Date', 'Time', 'Revenue'])

In [44]:
duplicates_sorted.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time,Revenue
494,536409,21866,UNION JACK FLAG LUGGAGE TAG,1,2010-12-01 11:45:00,1.25,17908.0,United Kingdom,Regular,2010-12-01,11:45:00,1.25
517,536409,21866,UNION JACK FLAG LUGGAGE TAG,1,2010-12-01 11:45:00,1.25,17908.0,United Kingdom,Regular,2010-12-01,11:45:00,1.25
485,536409,22111,SCOTTIE DOG HOT WATER BOTTLE,1,2010-12-01 11:45:00,4.95,17908.0,United Kingdom,Regular,2010-12-01,11:45:00,4.95
539,536409,22111,SCOTTIE DOG HOT WATER BOTTLE,1,2010-12-01 11:45:00,4.95,17908.0,United Kingdom,Regular,2010-12-01,11:45:00,4.95
489,536409,22866,HAND WARMER SCOTTY DOG DESIGN,1,2010-12-01 11:45:00,2.10,17908.0,United Kingdom,Regular,2010-12-01,11:45:00,2.10

In [45]:
duplicates_sorted.shape

(10139, 12)

In [46]:
dff=df.drop_duplicates(keep='first')

In [47]:
dff.shape

(533916, 12)

In [48]:
# here total rows in df = 539,178  
# Total repeated rows = 10,139  (All duplicate occurrences counted, including first copies)  
# Extracting unique entries...  
# Total unique rows = 533,916  (Each duplicate appears only once as in now they are no more duplicate)  
# Finding the real number of duplicate rows...  
# Total dataset rows = 539,178  
# After dropping duplicates, remaining rows = 533,916  
# Rows removed = 539,178 - 533,916 = 5,262  
# Real duplicate rows = Total repeated rows - Removed rows  
#                     = 10,139 - 5,262 = 4,877  
# Confirming: cross check Total rows - Real duplicate rows = 539,178 - 4,877 = 533,916  
# This matches df.drop_duplicates(keep='first').shape so done!

In [49]:
df.shape

(539178, 12)

In [50]:
dff[dff.duplicated()]

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country, OrderType, Date, Time, Revenue]
Index: []

In [51]:
dff.duplicated().sum()

0

In [52]:
#removed duplicate entries

In [53]:
dff.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1449
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     134077
Country             0
OrderType           0
Date                0
Time                0
Revenue             0
dtype: int64

### CLEANING DATA

In [54]:
dff[(dff['Quantity']<0) & (dff['UnitPrice']==0)]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time,Revenue
2406,536589,21777,NaN,-10,2010-12-01 16:50:00,0.0,NaN,United Kingdom,Regular,2010-12-01,16:50:00,-0.0
4347,536764,84952C,NaN,-38,2010-12-02 14:42:00,0.0,NaN,United Kingdom,Regular,2010-12-02,14:42:00,-0.0
7188,536996,22712,NaN,-20,2010-12-03 15:30:00,0.0,NaN,United Kingdom,Regular,2010-12-03,15:30:00,-0.0
7189,536997,22028,NaN,-20,2010-12-03 15:30:00,0.0,NaN,United Kingdom,Regular,2010-12-03,15:30:00,-0.0
7190,536998,85067,NaN,-6,2010-12-03 15:30:00,0.0,NaN,United Kingdom,Regular,2010-12-03,15:30:00,-0.0
...,...,...,...,...,...,...,...,...,...,...,...,...
535333,581210,23395,check,-26,2011-12-07 18:36:00,0.0,NaN,United Kingdom,Regular,2011-12-07,18:36:00,-0.0
535335,581212,22578,lost,-1050,2011-12-07 18:38:00,0.0,NaN,United Kingdom,Regular,2011-12-07,18:38:00,-0.0
535336,581213,22576,check,-30,2011-12-07 18:38:00,0.0,NaN,United Kingdom,Regular,2011-12-07,18:38:00,-0.0
536908,581226,23090,missing,-338,2011-12-08 09:56:00,0.0,NaN,United Kingdom,Regular,2011-12-08,09:56:00,-0.0
538919,581422,23169,smashed,-235,2011-12-08 15:24:00,0.0,NaN,United Kingdom,Regular,2011-12-08,15:24:00,-0.0

In [55]:
check = dff[(dff['Quantity']<0) & (dff['OrderType']=='Regular')]

In [56]:
check

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time,Revenue
2406,536589,21777,NaN,-10,2010-12-01 16:50:00,0.0,NaN,United Kingdom,Regular,2010-12-01,16:50:00,-0.0
4347,536764,84952C,NaN,-38,2010-12-02 14:42:00,0.0,NaN,United Kingdom,Regular,2010-12-02,14:42:00,-0.0
7188,536996,22712,NaN,-20,2010-12-03 15:30:00,0.0,NaN,United Kingdom,Regular,2010-12-03,15:30:00,-0.0
7189,536997,22028,NaN,-20,2010-12-03 15:30:00,0.0,NaN,United Kingdom,Regular,2010-12-03,15:30:00,-0.0
7190,536998,85067,NaN,-6,2010-12-03 15:30:00,0.0,NaN,United Kingdom,Regular,2010-12-03,15:30:00,-0.0
...,...,...,...,...,...,...,...,...,...,...,...,...
535333,581210,23395,check,-26,2011-12-07 18:36:00,0.0,NaN,United Kingdom,Regular,2011-12-07,18:36:00,-0.0
535335,581212,22578,lost,-1050,2011-12-07 18:38:00,0.0,NaN,United Kingdom,Regular,2011-12-07,18:38:00,-0.0
535336,581213,22576,check,-30,2011-12-07 18:38:00,0.0,NaN,United Kingdom,Regular,2011-12-07,18:38:00,-0.0
536908,581226,23090,missing,-338,2011-12-08 09:56:00,0.0,NaN,United Kingdom,Regular,2011-12-08,09:56:00,-0.0
538919,581422,23169,smashed,-235,2011-12-08 15:24:00,0.0,NaN,United Kingdom,Regular,2011-12-08,15:24:00,-0.0

In [57]:
check['Description'].unique()

array([nan, '?', 'check', 'damages', 'faulty', 'Dotcom sales',
       'reverse 21/5/10 adjustment', 'mouldy, thrown away.', 'counted',
       'Given away', 'Dotcom', 'label mix up', 'samples/damages',
       'thrown away', 'incorrectly made-thrown away.', 'showroom', 'MIA',
       'Dotcom set', 'wrongly sold as sets', 'Amazon sold sets',
       'dotcom sold sets', 'wrongly sold sets', '? sold as sets?',
       '?sold as sets?', 'Thrown away.', 'damages/display',
       'damaged stock', 'broken', 'throw away', 'wrong barcode (22467)',
       'wrong barcode', 'barcode problem', '?lost',
       "thrown away-can't sell.", "thrown away-can't sell", 'damages?',
       're dotcom quick fix.', "Dotcom sold in 6's", 'sold in set?',
       'cracked', 'sold as 22467', 'Damaged',
       'mystery! Only ever imported 1800',
       'MERCHANT CHANDLER CREDIT ERROR, STO', 'POSSIBLE DAMAGES OR LOST?',
       'damaged', 'DAMAGED', 'Display', 'Missing', 'wrong code?',
       'wrong code', 'adjust', 'crushed', 'damages/showroom etc',
       'samples', 'damages/credits from ASOS.',
       'Not rcvd in 10/11/2010 delivery', 'Thrown away-rusty',
       'sold as set/6 by dotcom', 'wet/rusty', 'damages/dotcom?',
       'smashed', 'reverse previous adjustment',
       'incorrectly credited C550456 see 47', 'wet damaged',
       'Water damaged', 'missing', 'sold as set on dotcom',
       'sold as set on dotcom and amazon', 'water damage',
       'sold as set by dotcom', 'Printing smudges/thrown away',
       'printing smudges/thrown away', 'found some more on shelf',
       'Show Samples', 'mix up with c', 'mouldy, unsaleable.',
       'wrongly marked. 23343 in box', 'stock creditted wrongly', 'ebay',
       'incorrectly put back into stock', 'Damages/samples',
       'Sold as 1 on dotcom', 'taig adjust no stock',
       'code mix up? 84930', '?display?', 'sold as 1', '?missing',
       'crushed ctn', 'Crushed', 'temp adjustment', '??', 'test',
       'OOPS ! adjustment', 'Dagamed',
       'historic computer difference?....se', 'Incorrect stock entry.',
       'incorrect stock entry.', 'wrongly coded-23343', 'stock check',
       'crushed boxes', 'WET/MOULDY', "can't find", 'mouldy',
       'Wet pallet-thrown away', 'adjustment', '20713 wrongly marked',
       're-adjustment', 'Breakages', '20713', 'wrongly coded 20713',
       'Damages', 'CHECK', 'Unsaleable, destroyed.', 'dotcom sales',
       'damages wax', 'water damaged', 'Wrongly mrked had 85123a in box',
       'wrongly marked carton 22804', 'missing?', 'wet rusty', '???lost',
       'sold with wrong barcode', 'rusty thrown away', 'rusty throw away',
       'dotcom', '?? missing', 'wet pallet', '????missing', '???missing',
       'lost in space', 'wet?', 'lost??', '???', 'wet', 'wet boxes',
       '????damages????', 'mixed up', 'lost'], dtype=object)

In [58]:
#In general the entries with neagtive quantities were cancelled but here we can see entries
#with negative quantities + regular+ No CustomerID & No UnitPrice also
#as seen above most of the data is either lost, faulty,damaged or incorrect thus dropping these would be better.

In [59]:
check['CustomerID'].unique()

array([nan])

In [60]:
dff = dff[~((dff['Quantity']<0) & (dff['OrderType']=='Regular'))] #dropping the check data

In [61]:
dff.isnull().sum()

InvoiceNo           0
StockCode           0
Description       587
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     132741
Country             0
OrderType           0
Date                0
Time                0
Revenue             0
dtype: int64

In [62]:
pd.set_option('display.max_columns', None)  # Show all columns
pd.set_option('display.width', 50)      
pd.set_option('display.max_rows', 50)

### FINDINGS

In [64]:
#findings 
# a lot of NaN values in CustomerID but these rows have valid info in the remaining columns thus nan can be replaced by not found


#the rows where BOTH Description and CustomerID are Nan, it's UnitPrice is also 0 thus it seems wrong and not useful for our analysis so
#DROPPING ALL WHERE BOTH ARE NaN
# one row has ? in descp and nan in custid and 0 as unitprice thus drop


#where  only CustomerID is Nan there is some worth/price in the UnitPrice and also Description is present so not dropping
#thus indicating only missing data in customerID and it is a legit purchase so keeping them and replacing Nan with Not Found would solve the problem.

#also rows with UnitPrice as 0 doesnt make sense
#BUT some rows have UnitPrice 0  & CustomerID Nan + no problem in remaining cols thus MAYBE FREE? AS THEY ARE REGULAR ORDERS!

#Some rows have NEGATIVE Quantity + VALID UnitPrice + CANCELLED AND DESCRIPTION IS (BANK CHARGES,  SAMPLES, MANUAL) just custid is nan
#could be refunds 
#NEGATIVES ARE CANCELLED ORDERS

In [65]:
dff.isnull().sum()

InvoiceNo           0
StockCode           0
Description       587
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     132741
Country             0
OrderType           0
Date                0
Time                0
Revenue             0
dtype: int64

In [66]:
dff.shape

(532580, 12)

In [67]:
rows_with_nan_in_both = dff[dff['Description'].isna() & dff['CustomerID'].isna()]

In [68]:
print(rows_with_nan_in_both)

       InvoiceNo StockCode Description  \
622       536414     22139         NaN
1970      536545     21134         NaN
1971      536546     22145         NaN
1972      536547     37509         NaN
1987      536549    85226A         NaN
...          ...       ...         ...
533712    581103     22689         NaN
535326    581203     23406         NaN
535332    581209     21620         NaN
536981    581234     72817         NaN
538554    581408     85175         NaN

        Quantity         InvoiceDate  UnitPrice  \
622           56 2010-12-01 11:52:00        0.0
1970           1 2010-12-01 14:32:00        0.0
1971           1 2010-12-01 14:33:00        0.0
1972           1 2010-12-01 14:33:00        0.0
1987           1 2010-12-01 14:34:00        0.0
...          ...                 ...        ...
533712         4 2011-12-07 11:58:00        0.0
535326        15 2011-12-07 18:31:00        0.0
535332         6 2011-12-07 18:35:00        0.0
536981        27 2011-12-08 10:33:00        0.0
538554        20 2011-12-08 14:06:00        0.0

        CustomerID         Country OrderType  \
622            NaN  United Kingdom   Regular
1970           NaN  United Kingdom   Regular
1971           NaN  United Kingdom   Regular
1972           NaN  United Kingdom   Regular
1987           NaN  United Kingdom   Regular
...            ...             ...       ...
533712         NaN  United Kingdom   Regular
535326         NaN  United Kingdom   Regular
535332         NaN  United Kingdom   Regular
536981         NaN  United Kingdom   Regular
538554         NaN  United Kingdom   Regular

             Date      Time  Revenue
622    2010-12-01  11:52:00      0.0
1970   2010-12-01  14:32:00      0.0
1971   2010-12-01  14:33:00      0.0
1972   2010-12-01  14:33:00      0.0
1987   2010-12-01  14:34:00      0.0
...           ...       ...      ...
533712 2011-12-07  11:58:00      0.0
535326 2011-12-07  18:31:00      0.0
535332 2011-12-07  18:35:00      0.0
536981 2011-12-08  10:33:00      0.0
538554 2011-12-08  14:06:00      0.0

[587 rows x 12 columns]

In [69]:
dffcleaned = dff.dropna(subset=['Description', 'CustomerID'], how='all')

In [70]:
dffcleaned.shape #532580-587= 531993

(531993, 12)

In [71]:
dffcleaned.isnull().sum()

InvoiceNo           0
StockCode           0
Description         0
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     132154
Country             0
OrderType           0
Date                0
Time                0
Revenue             0
dtype: int64

In [72]:
dffcleaned['CustomerID'] = dffcleaned['CustomerID'].fillna('Not Found')

C:\Users\91935\AppData\Local\Temp\ipykernel_5676\226052747.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dffcleaned['CustomerID'] = dffcleaned['CustomerID'].fillna('Not Found')

In [73]:
dffcleaned.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
OrderType      0
Date           0
Time           0
Revenue        0
dtype: int64

### DONE WITH DATA CLEANING!

In [74]:
dffcleaned.shape

(531993, 12)

In [75]:
dffcleaned.duplicated().sum()

0

In [76]:
dffcleaned.info()

<class 'pandas.core.frame.DataFrame'>
Index: 531993 entries, 0 to 541908
Data columns (total 12 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    531993 non-null  object
 1   StockCode    531993 non-null  object
 2   Description  531993 non-null  object
 3   Quantity     531993 non-null  int64
 4   InvoiceDate  531993 non-null  datetime64[ns]
 5   UnitPrice    531993 non-null  float64
 6   CustomerID   531993 non-null  object
 7   Country      531993 non-null  object
 8   OrderType    531993 non-null  object
 9   Date         531993 non-null  datetime64[ns]
 10  Time         531993 non-null  object
 11  Revenue      531993 non-null  float64
dtypes: datetime64[ns](2), float64(2), int64(1), object(7)
memory usage: 52.8+ MB

In [77]:
dffcleaned['CustomerID'] = dffcleaned['CustomerID'].astype(str).str.replace('.0', '', regex=False)

C:\Users\91935\AppData\Local\Temp\ipykernel_5676\1143392874.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dffcleaned['CustomerID'] = dffcleaned['CustomerID'].astype(str).str.replace('.0', '', regex=False)

###   DATA CLEANED!

In [78]:
dffcleaned.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time,Revenue
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,Regular,2010-12-01,08:26:00,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,Regular,2010-12-01,08:26:00,20.34

In [79]:
dffcleaned.describe()

,Quantity,InvoiceDate,UnitPrice,Date,Revenue
count,531993.000000,531993,531993.000000,531993,531993.000000
mean,10.021884,2011-07-04 12:11:18.609154816,3.316449,2011-07-03 22:36:42.213938944,18.368314
min,-80995.000000,2010-12-01 08:26:00,0.000000,2010-12-01 00:00:00,-168469.600000
25%,1.000000,2011-03-28 10:52:00,1.250000,2011-03-28 00:00:00,3.750000
50%,3.000000,2011-07-19 17:02:00,2.080000,2011-07-19 00:00:00,9.900000
75%,10.000000,2011-10-19 09:58:00,4.130000,2011-10-19 00:00:00,17.400000
max,80995.000000,2011-12-09 12:50:00,1050.150000,2011-12-09 00:00:00,168469.600000
std,217.706968,NaN,5.361642,NaN,369.494411

### SEPARATING DATA INTO POSITIVE AND NEGATIVE(CANCELLED)

In [80]:
dffcleaned = dffcleaned[(dffcleaned['Quantity']>0) & (dffcleaned['UnitPrice']>0)]

In [81]:
dffcleaned[dffcleaned['Description']=='?']

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country, OrderType, Date, Time, Revenue]
Index: []

In [82]:
dffcleaned.dtypes

InvoiceNo              object
StockCode              object
Description            object
Quantity                int64
InvoiceDate    datetime64[ns]
UnitPrice             float64
CustomerID             object
Country                object
OrderType              object
Date           datetime64[ns]
Time                   object
Revenue               float64
dtype: object

In [83]:
dffcleaned['StockCode'].unique()

array(['85123A', '71053', '84406B', ..., '90214U', '47591b', '23843'],
      dtype=object)

In [84]:
dffcancelled = dffcleaned[dffcleaned['InvoiceNo'].str.startswith('C')]

In [85]:
dffcancelled.head()

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country, OrderType, Date, Time, Revenue]
Index: []

In [86]:
dffcancelled['InvoiceNo'].unique()

array([], dtype=object)

In [88]:
dffcleaned1 = dffcleaned.copy()

In [89]:
dffcleaned1.dtypes

InvoiceNo              object
StockCode              object
Description            object
Quantity                int64
InvoiceDate    datetime64[ns]
UnitPrice             float64
CustomerID             object
Country                object
OrderType              object
Date           datetime64[ns]
Time                   object
Revenue               float64
dtype: object

In [90]:
dffcleaned1['BaseInvoiceNo'] = dffcleaned1['InvoiceNo'].str.replace('C', '' ,regex=True)

In [91]:
cancelledorders = dffcleaned1[dffcleaned1['InvoiceNo'].str.startswith('C')]

In [92]:
cancelledorders.head()

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country, OrderType, Date, Time, Revenue, BaseInvoiceNo]
Index: []

In [93]:
regularorders = dffcleaned1[dffcleaned1['InvoiceNo'].isin(cancelledorders['BaseInvoiceNo'])]

In [94]:
dffcleaned1 = dffcleaned1[~dffcleaned1['BaseInvoiceNo'].isin(cancelledorders['BaseInvoiceNo'])]

In [95]:
dffcleaned1.drop(columns=['BaseInvoiceNo'], inplace=True)

In [96]:
dffcleaned1.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time,Revenue
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,Regular,2010-12-01,08:26:00,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,Regular,2010-12-01,08:26:00,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,Regular,2010-12-01,08:26:00,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,Regular,2010-12-01,08:26:00,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,Regular,2010-12-01,08:26:00,20.34

In [97]:
dffcleaned1.shape

(522724, 12)

In [98]:
dffcleaned.shape

(522724, 12)

In [99]:
#now checking

In [100]:
dffcleaned1[dffcleaned1['InvoiceNo'].str.startswith('C')].shape

(0, 12)

In [101]:
dffcleaned1.shape, dffcleaned.shape

((522724, 12), (522724, 12))

In [102]:
dffcleaned1.columns

Index(['InvoiceNo', 'StockCode', 'Description',
       'Quantity', 'InvoiceDate', 'UnitPrice',
       'CustomerID', 'Country', 'OrderType',
       'Date', 'Time', 'Revenue'],
      dtype='object')

In [103]:
removed = dffcleaned1[~dffcleaned1['InvoiceNo'].isin(dffcleaned['InvoiceNo'])]

In [104]:
removed.head()

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country, OrderType, Date, Time, Revenue]
Index: []

In [105]:
removed.shape

(0, 12)

### Saving to csv Files

In [106]:
dffcleaned1.to_csv("dffcleaned1.csv", index=False)

In [110]:
# redoing the cancelled dataframe 
rows_with_nan_in_both = dff[dff['Description'].isna() & dff['CustomerID'].isna()]
dffnew = dff.dropna(subset=['Description', 'CustomerID'], how='all')
dffnew['CustomerID'] = dffnew['CustomerID'].fillna('Not Found')
dffnew.isnull().sum()

C:\Users\91935\AppData\Local\Temp\ipykernel_5676\798734075.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dffnew['CustomerID'] = dffnew['CustomerID'].fillna('Not Found')

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
OrderType      0
Date           0
Time           0
Revenue        0
dtype: int64

In [111]:
Cancelleddata = dffnew[dffnew['InvoiceNo'].str.startswith('C')].copy()

In [112]:
Cancelleddata.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,OrderType,Date,Time,Revenue
154,C536383,35004C,SET OF 3 COLOURED FLYING DUCKS,-1,2010-12-01 09:49:00,4.65,15311.0,United Kingdom,Cancelled,2010-12-01,09:49:00,-4.65
235,C536391,22556,PLASTERS IN TIN CIRCUS PARADE,-12,2010-12-01 10:24:00,1.65,17548.0,United Kingdom,Cancelled,2010-12-01,10:24:00,-19.80
236,C536391,21984,PACK OF 12 PINK PAISLEY TISSUES,-24,2010-12-01 10:24:00,0.29,17548.0,United Kingdom,Cancelled,2010-12-01,10:24:00,-6.96
237,C536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,-24,2010-12-01 10:24:00,0.29,17548.0,United Kingdom,Cancelled,2010-12-01,10:24:00,-6.96
238,C536391,21980,PACK OF 12 RED RETROSPOT TISSUES,-24,2010-12-01 10:24:00,0.29,17548.0,United Kingdom,Cancelled,2010-12-01,10:24:00,-6.96

In [113]:
Cancelleddata.to_csv("Cancelleddata.csv", index=False)